In [1]:
import pandas as pd

In [2]:
s = pd.Series([10,20,30], index=['a','b','c'])

In [3]:
s.head()

a    10
b    20
c    30
dtype: int64

In [4]:
pb = pd.read_csv('QVI_purchase_behaviour.csv')
td = pd.read_excel("QVI_transaction_data.xlsx")

In [5]:
pb.head()

   LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
0            1000   YOUNG SINGLES/COUPLES          Premium
1            1002   YOUNG SINGLES/COUPLES       Mainstream
2            1003          YOUNG FAMILIES           Budget
3            1004   OLDER SINGLES/COUPLES       Mainstream
4            1005  MIDAGE SINGLES/COUPLES       Mainstream

In [6]:
td.head(15)

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
0,43390,1,1000,1,5,Natural Chip Compny SeaSalt175g,2,6.0
1,43599,1,1307,348,66,CCs Nacho Cheese 175g,3,6.3
2,43605,1,1343,383,61,Smiths Crinkle Cut Chips Chicken 170g,2,2.9
3,43329,2,2373,974,69,Smiths Chip Thinly S/Cream&Onion 175g,5,15.0
4,43330,2,2426,1038,108,Kettle Tortilla ChpsHny&Jlpno Chili 150g,3,13.8
5,43604,4,4074,2982,57,Old El Paso Salsa Dip Tomato Mild 300g,1,5.1
6,43601,4,4149,3333,16,Smiths Crinkle Chips Salt & Vinegar 330g,1,5.7
7,43601,4,4196,3539,24,Grain Waves Sweet Chilli 210g,1,3.6
8,43332,5,5026,4525,42,Doritos Corn Chip Mexican Jalapeno 150g,1,3.9
9,43330,7,7150,6900,52,Grain Waves Sour Cream&Chives 210G,2,7.2
10,43602,7,7215,7176,16,Smiths Crinkle Chips Salt & Vinegar 330g,1,5.7
11,43332,8,8294,8221,114,Kettle Sensations Siracha Lime 150g,5,23.0
12,43603,9,9208,8634,15,Twisties Cheese 270g,2,9.2
13,43329,13,13213,12447,92,WW Crinkle Cut Chicken 175g,1,1.7
14,43600,19,19272,16686,44,Thins Chips Light& Tangy 175g,1,3.3

In [7]:
td.tail()

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_NAME,PROD_QTY,TOT_SALES
264831,43533,272,272319,270088,89,Kettle Sweet Chilli And Sour Cream 175g,2,10.8
264832,43325,272,272358,270154,74,Tostitos Splash Of Lime 175g,1,4.4
264833,43410,272,272379,270187,51,Doritos Mexicana 170g,2,8.8
264834,43461,272,272379,270188,42,Doritos Corn Chip Mexican Jalapeno 150g,2,7.8
264835,43365,272,272380,270189,74,Tostitos Splash Of Lime 175g,2,8.8

In [8]:
pb.tail()

       LYLTY_CARD_NBR               LIFESTAGE PREMIUM_CUSTOMER
72632         2370651  MIDAGE SINGLES/COUPLES       Mainstream
72633         2370701          YOUNG FAMILIES       Mainstream
72634         2370751          YOUNG FAMILIES          Premium
72635         2370961          OLDER FAMILIES           Budget
72636         2373711   YOUNG SINGLES/COUPLES       Mainstream

In [9]:
pb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72637 entries, 0 to 72636
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   LYLTY_CARD_NBR    72637 non-null  int64
 1   LIFESTAGE         72637 non-null  object
 2   PREMIUM_CUSTOMER  72637 non-null  object
dtypes: int64(1), object(2)
memory usage: 1.7+ MB

In [10]:
td.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264836 entries, 0 to 264835
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   DATE            264836 non-null  int64
 1   STORE_NBR       264836 non-null  int64
 2   LYLTY_CARD_NBR  264836 non-null  int64
 3   TXN_ID          264836 non-null  int64
 4   PROD_NBR        264836 non-null  int64
 5   PROD_NAME       264836 non-null  object
 6   PROD_QTY        264836 non-null  int64
 7   TOT_SALES       264836 non-null  float64
dtypes: float64(1), int64(6), object(1)
memory usage: 16.2+ MB

In [11]:
pb.describe()

       LYLTY_CARD_NBR
count    7.263700e+04
mean     1.361859e+05
std      8.989293e+04
min      1.000000e+03
25%      6.620200e+04
50%      1.340400e+05
75%      2.033750e+05
max      2.373711e+06

In [12]:
td.describe()

,DATE,STORE_NBR,LYLTY_CARD_NBR,TXN_ID,PROD_NBR,PROD_QTY,TOT_SALES
count,264836.000000,264836.00000,2.648360e+05,2.648360e+05,264836.000000,264836.000000,264836.000000
mean,43464.036260,135.08011,1.355495e+05,1.351583e+05,56.583157,1.907309,7.304200
std,105.389282,76.78418,8.057998e+04,7.813303e+04,32.826638,0.643654,3.083226
min,43282.000000,1.00000,1.000000e+03,1.000000e+00,1.000000,1.000000,1.500000
25%,43373.000000,70.00000,7.002100e+04,6.760150e+04,28.000000,2.000000,5.400000
50%,43464.000000,130.00000,1.303575e+05,1.351375e+05,56.000000,2.000000,7.400000
75%,43555.000000,203.00000,2.030942e+05,2.027012e+05,85.000000,2.000000,9.200000
max,43646.000000,272.00000,2.373711e+06,2.415841e+06,114.000000,200.000000,650.000000

In [13]:
pb.isnull().sum()

LYLTY_CARD_NBR      0
LIFESTAGE           0
PREMIUM_CUSTOMER    0
dtype: int64

In [14]:
td.isnull().sum()

DATE              0
STORE_NBR         0
LYLTY_CARD_NBR    0
TXN_ID            0
PROD_NBR          0
PROD_NAME         0
PROD_QTY          0
TOT_SALES         0
dtype: int64

In [15]:
pb.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
72632    False
72633    False
72634    False
72635    False
72636    False
Length: 72637, dtype: bool

In [16]:
pb.rename(columns={"LYLTY_CARD_NBR":'Loayality_card_id'}, inplace="True")

In [17]:
pb.head()

   Loayality_card_id               LIFESTAGE PREMIUM_CUSTOMER
0               1000   YOUNG SINGLES/COUPLES          Premium
1               1002   YOUNG SINGLES/COUPLES       Mainstream
2               1003          YOUNG FAMILIES           Budget
3               1004   OLDER SINGLES/COUPLES       Mainstream
4               1005  MIDAGE SINGLES/COUPLES       Mainstream

In [24]:
s = pd.Series([10,20,30], index=['a','b','c'])
s.head()

a    10
b    20
c    30
dtype: int64

In [22]:
df = pd.DataFrame({
    'name':['Lucy','Silver'],
    'age':[18,23],
    'hobies':["reading","music"]})

df.head()

     name  age   hobies
0    Lucy   18  reading
1  Silver   23    music

In [26]:
print("Purchase Behaviour Columns:", pb.columns.tolist())
print("Transaction Data Columns:", td.columns.tolist())

Purchase Behaviour Columns: ['Loayality_card_id', 'LIFESTAGE', 'PREMIUM_CUSTOMER']
Transaction Data Columns: ['DATE', 'STORE_NBR', 'LYLTY_CARD_NBR', 'TXN_ID', 'PROD_NBR', 'PROD_NAME', 'PROD_QTY', 'TOT_SALES']

In [27]:
# Remove extra spaces in column names
pb.columns = pb.columns.str.strip()
td.columns = td.columns.str.strip()

In [28]:
print(pb.columns.tolist())

['Loayality_card_id', 'LIFESTAGE', 'PREMIUM_CUSTOMER']

In [29]:
pb.rename(columns={'Customer_ID': 'LYLTY_CARD_NBR'}, inplace=True)
td.rename(columns={'CardNumber': 'LYLTY_CARD_NBR'}, inplace=True)

In [32]:
print("PB Columns:", pb.columns.tolist())
print("TD Columns:", td.columns.tolist())

PB Columns: ['Loayality_card_id', 'LIFESTAGE', 'PREMIUM_CUSTOMER']
TD Columns: ['DATE', 'STORE_NBR', 'LYLTY_CARD_NBR', 'TXN_ID', 'PROD_NBR', 'PROD_NAME', 'PROD_QTY', 'TOT_SALES']

In [34]:
PBColumns: ['Customer_ID', 'LIFESTAGE', 'PREMIUM_CUSTOMER']
TDColumns: ['DATE', 'STORE_NBR', 'LYLTY_CARD_NUMBER', 'PROD_NAME', 'TOT_SALES']

In [35]:
pb.rename(columns={'Customer_ID': 'LYLTY_CARD_NBR'}, inplace=True)
td.rename(columns={'LYLTY_CARD_NUMBER': 'LYLTY_CARD_NBR'}, inplace=True)

In [37]:
pb.columns = pb.columns.str.strip()
td.columns = td.columns.str.strip()
print(pb.columns.tolist())
print(td.columns.tolist())

['Loayality_card_id', 'LIFESTAGE', 'PREMIUM_CUSTOMER']
['DATE', 'STORE_NBR', 'LYLTY_CARD_NBR', 'TXN_ID', 'PROD_NBR', 'PROD_NAME', 'PROD_QTY', 'TOT_SALES']

In [39]:

pb.rename(columns={'Loayality_card_id': 'LYLTY_CARD_NBR'}, inplace=True)

common_customers = set(pb['LYLTY_CARD_NBR']).intersection(set(td['LYLTY_CARD_NBR']))
print("Common Customers:", len(common_customers))

Common Customers: 72637

In [40]:
# Make sure column names are standardized
pb.rename(columns={'Loayality_card_id': 'LYLTY_CARD_NBR'}, inplace=True)

# Merge
merged_df = td.merge(pb, on='LYLTY_CARD_NBR', how='left')

print(merged_df.head())
print(merged_df.info())

    DATE  STORE_NBR  LYLTY_CARD_NBR  TXN_ID  PROD_NBR  \
0  43390          1            1000       1         5
1  43599          1            1307     348        66
2  43605          1            1343     383        61
3  43329          2            2373     974        69
4  43330          2            2426    1038       108

                                  PROD_NAME  PROD_QTY  TOT_SALES  \
0    Natural Chip        Compny SeaSalt175g         2        6.0
1                  CCs Nacho Cheese    175g         3        6.3
2    Smiths Crinkle Cut  Chips Chicken 170g         2        2.9
3    Smiths Chip Thinly  S/Cream&Onion 175g         5       15.0
4  Kettle Tortilla ChpsHny&Jlpno Chili 150g         3       13.8

                LIFESTAGE PREMIUM_CUSTOMER
0   YOUNG SINGLES/COUPLES          Premium
1  MIDAGE SINGLES/COUPLES           Budget
2  MIDAGE SINGLES/COUPLES           Budget
3  MIDAGE SINGLES/COUPLES           Budget
4  MIDAGE SINGLES/COUPLES           Budget
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 264836 entries, 0 to 264835
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   DATE              264836 non-null  int64
 1   STORE_NBR         264836 non-null  int64
 2   LYLTY_CARD_NBR    264836 non-null  int64
 3   TXN_ID            264836 non-null  int64
 4   PROD_NBR          264836 non-null  int64
 5   PROD_NAME         264836 non-null  object
 6   PROD_QTY          264836 non-null  int64
 7   TOT_SALES         264836 non-null  float64
 8   LIFESTAGE         264836 non-null  object
 9   PREMIUM_CUSTOMER  264836 non-null  object
dtypes: float64(1), int64(6), object(3)
memory usage: 20.2+ MB
None

In [41]:
sales_by_product = merged_df.groupby('PROD_NAME')['TOT_SALES'].sum().sort_values(ascending=False)
print(sales_by_product.head(10))

PROD_NAME
Dorito Corn Chp     Supreme 380g            40352.0
Smiths Crnkle Chip  Orgnl Big Bag 380g      36367.6
Smiths Crinkle Chips Salt & Vinegar 330g    34804.2
Kettle Mozzarella   Basil & Pesto 175g      34457.4
Smiths Crinkle      Original 330g           34302.6
Cheezels Cheese 330g                        34296.9
Doritos Cheese      Supreme 330g            33390.6
Kettle Sweet Chilli And Sour Cream 175g     33031.8
Kettle Original 175g                        32740.2
Kettle Sea Salt     And Vinegar 175g        32589.0
Name: TOT_SALES, dtype: float64

In [42]:
avg_spend_segment = merged_df.groupby('LIFESTAGE')['TOT_SALES'].mean().sort_values(ascending=False)
print(avg_spend_segment)

LIFESTAGE
OLDER SINGLES/COUPLES     7.386823
RETIREES                  7.364325
MIDAGE SINGLES/COUPLES    7.357678
NEW FAMILIES              7.289124
OLDER FAMILIES            7.279760
YOUNG FAMILIES            7.252709
YOUNG SINGLES/COUPLES     7.158515
Name: TOT_SALES, dtype: float64

Sales by Lifestage & Premium Status

In [43]:
pivot_sales = pd.pivot_table(
    merged_df,
    values='TOT_SALES',
    index='LIFESTAGE',
    columns='PREMIUM_CUSTOMER',
    aggfunc='sum',
    fill_value=0
)
print(pivot_sales)

PREMIUM_CUSTOMER           Budget  Mainstream    Premium
LIFESTAGE
MIDAGE SINGLES/COUPLES   35514.80    90803.85   58432.65
NEW FAMILIES             21928.45    17013.90   11491.10
OLDER FAMILIES          168363.25   103445.55   81958.40
OLDER SINGLES/COUPLES   136769.80   133393.80  132263.15
RETIREES                113147.80   155677.05   97646.05
YOUNG FAMILIES          139345.85    92788.75   84025.50
YOUNG SINGLES/COUPLES    61141.60   157621.60   41642.10

Average quantity by product and lifestage

In [44]:
pivot_qty = pd.pivot_table(
    merged_df,
    values='PROD_QTY',
    index='PROD_NAME',
    columns='LIFESTAGE',
    aggfunc='mean',
    fill_value=0
)
print(pivot_qty.head())

LIFESTAGE                       MIDAGE SINGLES/COUPLES  NEW FAMILIES  \
PROD_NAME
Burger Rings 220g                             1.888158      1.750000
CCs Nacho Cheese    175g                      1.948718      1.884615
CCs Original 175g                             1.858156      1.750000
CCs Tasty Cheese    175g                      1.852941      1.800000
Cheetos Chs & Bacon Balls 190g                1.851064      1.628571

LIFESTAGE                       OLDER FAMILIES  OLDER SINGLES/COUPLES  \
PROD_NAME
Burger Rings 220g                     1.929178               1.893836
CCs Nacho Cheese    175g              1.927445               1.905350
CCs Original 175g                     1.950980               1.905085
CCs Tasty Cheese    175g              1.937107               1.875399
Cheetos Chs & Bacon Balls 190g        1.967320               1.918239

LIFESTAGE                       RETIREES  YOUNG FAMILIES  \
PROD_NAME
Burger Rings 220g               1.921875        1.959044
CCs Nacho Cheese    175g        1.897778        1.939297
CCs Original 175g               1.876364        1.938356
CCs Tasty Cheese    175g        1.883817        1.921502
Cheetos Chs & Bacon Balls 190g  1.853982        1.942029

LIFESTAGE                       YOUNG SINGLES/COUPLES
PROD_NAME
Burger Rings 220g                            1.758427
CCs Nacho Cheese    175g                     1.733945
CCs Original 175g                            1.855491
CCs Tasty Cheese    175g                     1.748768
Cheetos Chs & Bacon Balls 190g               1.785311